import json
from pprint import pprint

# b = {'ИнОрг': [], 'ПИФ': [], 'РФ': [], 'РосОрг': [], 'ФЛ': [{'Доля': {'Номинал': 10000.0, 'Процент': 5.0}, 'ИНН': '773718040200', 'Недост': False, 'СвязРуковод': [], 'СвязУчред': [], 'ФИО': 'Ишкова Марина Ивановна'}, {'Доля': {'Номинал': 48000.0, 'Процент': 24.0}, 'ИНН': '771700459518', 'Недост': False, 'СвязРуковод': ['1027739099783', '1035005525741'], 'СвязУчред': ['1037722024526', '1027739099783', '1027739082843', '1027739021155'], 'ФИО': 'Ковалев Алексей Юрьевич'}, {'Доля': {'Номинал': 48000.0, 'Процент': 24.0}, 'ИНН': '771600669776', 'Недост': False, 'СвязРуковод': [], 'СвязУчред': ['1037722024526', '1027739099783', '1027739082843', '1027739021155'], 'ФИО': 'Смирнов Виктор Евгеньевич'}, {'Доля': {'Номинал': 47000.0, 'Процент': 23.5}, 'ИНН': '771608958152', 'Недост': False, 'СвязРуковод': [], 'СвязУчред': [], 'ФИО': 'Ковалева Людмила Ивановна'}, {'Доля': {'Номинал': 47000.0, 'Процент': 23.5}, 'ИНН': '771607061120', 'Недост': False, 'СвязРуковод': [], 'СвязУчред': [], 'ФИО': 'Смирнова Галина Владимировна'}]}
# a = {"data": {"\u041e\u0413\u0420\u041d": "1118602009877", "\u0418\u041d\u041d": "8602184871", "\u041a\u041f\u041f": "860201001", "\u041e\u041a\u041f\u041e": "30507742", "\u0414\u0430\u0442\u0430\u0420\u0435\u0433": "2011-09-15", "\u0414\u0430\u0442\u0430\u041e\u0413\u0420\u041d": "2011-09-15", "\u041d\u0430\u0438\u043c\u0421\u043e\u043a\u0440": "\u041e\u041e\u041e \"\u041e\u0420\u0425\u0418\u0414\u0415\u042f\"", "\u041d\u0430\u0438\u043c\u041f\u043e\u043b\u043d": "\u041e\u0411\u0429\u0415\u0421\u0422\u0412\u041e \u0421 \u041e\u0413\u0420\u0410\u041d\u0418\u0427\u0415\u041d\u041d\u041e\u0419 \u041e\u0422\u0412\u0415\u0422\u0421\u0422\u0412\u0415\u041d\u041d\u041e\u0421\u0422\u042c\u042e \"\u041e\u0420\u0425\u0418\u0414\u0415\u042f\"", "\u0421\u0442\u0430\u0442\u0443\u0441": {"\u041a\u043e\u0434": "001", "\u041d\u0430\u0438\u043c": "\u0414\u0435\u0439\u0441\u0442\u0432\u0443\u0435\u0442"}, "\u0420\u0435\u0433\u0438\u043e\u043d": {"\u041a\u043e\u0434": "86", "\u041d\u0430\u0438\u043c": "\u0425\u0430\u043d\u0442\u044b-\u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u0438\u0439 \u0430\u0432\u0442\u043e\u043d\u043e\u043c\u043d\u044b\u0439 \u043e\u043a\u0440\u0443\u0433 - \u042e\u0433\u0440\u0430"}, "\u042e\u0440\u0410\u0434\u0440\u0435\u0441": {"\u041d\u0430\u0441\u041f\u0443\u043d\u043a\u0442": "\u0433. \u0421\u0443\u0440\u0433\u0443\u0442", "\u0410\u0434\u0440\u0435\u0441\u0420\u0424": "628403, \u0425\u0430\u043d\u0442\u044b-\u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u0438\u0439 \u0410\u041e - \u042e\u0433\u0440\u0430, \u0433. \u0421\u0443\u0440\u0433\u0443\u0442, \u0443\u043b. 30 \u041b\u0435\u0442 \u041f\u043e\u0431\u0435\u0434\u044b, \u0434. 10", "\u0418\u0434\u0413\u0410\u0420": null, "\u041d\u0435\u0434\u043e\u0441\u0442": false}, "\u041e\u041a\u0412\u042d\u0414": {"\u041a\u043e\u0434": "86.23", "\u041d\u0430\u0438\u043c": "\u0421\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u043f\u0440\u0430\u043a\u0442\u0438\u043a\u0430", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, "\u041e\u041a\u0412\u042d\u0414\u0414\u043e\u043f": [{"\u041a\u043e\u0434": "26.60.1", "\u041d\u0430\u0438\u043c": "\u041f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0441\u0442\u0432\u043e \u0430\u043f\u043f\u0430\u0440\u0430\u0442\u043e\u0432, \u043f\u0440\u0438\u043c\u0435\u043d\u044f\u0435\u043c\u044b\u0445 \u0432 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u0438\u0445 \u0446\u0435\u043b\u044f\u0445, \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u043d\u044b\u0445 \u043d\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0438 \u0440\u0435\u043d\u0442\u0433\u0435\u043d\u043e\u0432\u0441\u043a\u043e\u0433\u043e, \u0430\u043b\u044c\u0444\u0430-, \u0431\u0435\u0442\u0430- \u0438 \u0433\u0430\u043c\u043c\u0430-\u0438\u0437\u043b\u0443\u0447\u0435\u043d\u0438\u0439", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "47.73", "\u041d\u0430\u0438\u043c": "\u0422\u043e\u0440\u0433\u043e\u0432\u043b\u044f \u0440\u043e\u0437\u043d\u0438\u0447\u043d\u0430\u044f \u043b\u0435\u043a\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u043c\u0438 \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430\u043c\u0438 \u0432 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0445 \u043c\u0430\u0433\u0430\u0437\u0438\u043d\u0430\u0445 (\u0430\u043f\u0442\u0435\u043a\u0430\u0445)", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "47.74", "\u041d\u0430\u0438\u043c": "\u0422\u043e\u0440\u0433\u043e\u0432\u043b\u044f \u0440\u043e\u0437\u043d\u0438\u0447\u043d\u0430\u044f \u0438\u0437\u0434\u0435\u043b\u0438\u044f\u043c\u0438, \u043f\u0440\u0438\u043c\u0435\u043d\u044f\u0435\u043c\u044b\u043c\u0438 \u0432 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u0438\u0445 \u0446\u0435\u043b\u044f\u0445, \u043e\u0440\u0442\u043e\u043f\u0435\u0434\u0438\u0447\u0435\u0441\u043a\u0438\u043c\u0438 \u0438\u0437\u0434\u0435\u043b\u0438\u044f\u043c\u0438 \u0432 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0445 \u043c\u0430\u0433\u0430\u0437\u0438\u043d\u0430\u0445", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "47.75", "\u041d\u0430\u0438\u043c": "\u0422\u043e\u0440\u0433\u043e\u0432\u043b\u044f \u0440\u043e\u0437\u043d\u0438\u0447\u043d\u0430\u044f \u043a\u043e\u0441\u043c\u0435\u0442\u0438\u0447\u0435\u0441\u043a\u0438\u043c\u0438 \u0438 \u0442\u043e\u0432\u0430\u0440\u0430\u043c\u0438 \u043b\u0438\u0447\u043d\u043e\u0439 \u0433\u0438\u0433\u0438\u0435\u043d\u044b \u0432 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0445 \u043c\u0430\u0433\u0430\u0437\u0438\u043d\u0430\u0445", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "68.2", "\u041d\u0430\u0438\u043c": "\u0410\u0440\u0435\u043d\u0434\u0430 \u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u043c \u0438\u043b\u0438 \u0430\u0440\u0435\u043d\u0434\u043e\u0432\u0430\u043d\u043d\u044b\u043c \u043d\u0435\u0434\u0432\u0438\u0436\u0438\u043c\u044b\u043c \u0438\u043c\u0443\u0449\u0435\u0441\u0442\u0432\u043e\u043c", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "86.21", "\u041d\u0430\u0438\u043c": "\u041e\u0431\u0449\u0430\u044f \u0432\u0440\u0430\u0447\u0435\u0431\u043d\u0430\u044f \u043f\u0440\u0430\u043a\u0442\u0438\u043a\u0430", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}, {"\u041a\u043e\u0434": "86.90.9", "\u041d\u0430\u0438\u043c": "\u0414\u0435\u044f\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u044c \u0432 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u044b \u043f\u0440\u043e\u0447\u0430\u044f, \u043d\u0435 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u0430\u044f \u0432 \u0434\u0440\u0443\u0433\u0438\u0435 \u0433\u0440\u0443\u043f\u043f\u0438\u0440\u043e\u0432\u043a\u0438", "\u0412\u0435\u0440\u0441\u0438\u044f": "2014"}], "\u041e\u041a\u041e\u041f\u0424": {"\u041a\u043e\u0434": "12300", "\u041d\u0430\u0438\u043c": "\u041e\u0431\u0449\u0435\u0441\u0442\u0432\u0430 \u0441 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u043d\u043e\u0439 \u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0441\u0442\u044c\u044e"}, "\u041e\u041a\u0424\u0421": {"\u041a\u043e\u0434": "16", "\u041d\u0430\u0438\u043c": "\u0427\u0430\u0441\u0442\u043d\u0430\u044f \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0441\u0442\u044c"}, "\u041e\u041a\u041e\u0413\u0423": {"\u041a\u043e\u0434": "4210014", "\u041d\u0430\u0438\u043c": "\u041e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u0438, \u0443\u0447\u0440\u0435\u0436\u0434\u0435\u043d\u043d\u044b\u0435 \u044e\u0440\u0438\u0434\u0438\u0447\u0435\u0441\u043a\u0438\u043c\u0438 \u043b\u0438\u0446\u0430\u043c\u0438 \u0438\u043b\u0438 \u0433\u0440\u0430\u0436\u0434\u0430\u043d\u0430\u043c\u0438, \u0438\u043b\u0438 \u044e\u0440\u0438\u0434\u0438\u0447\u0435\u0441\u043a\u0438\u043c\u0438 \u043b\u0438\u0446\u0430\u043c\u0438 \u0438 \u0433\u0440\u0430\u0436\u0434\u0430\u043d\u0430\u043c\u0438 \u0441\u043e\u0432\u043c\u0435\u0441\u0442\u043d\u043e"}, "\u041e\u041a\u0410\u0422\u041e": {"\u041a\u043e\u0434": "71136000000", "\u041d\u0430\u0438\u043c": "\u0421\u0443\u0440\u0433\u0443\u0442"}, "\u041e\u041a\u0422\u041c\u041e": {"\u041a\u043e\u0434": "71876000001", "\u041d\u0430\u0438\u043c": "\u0433 \u0421\u0443\u0440\u0433\u0443\u0442"}, "\u0420\u0435\u0433\u0424\u041d\u0421": {"\u041a\u043e\u0434\u041e\u0440\u0433": "8617", "\u041d\u0430\u0438\u043c\u041e\u0440\u0433": "\u041c\u0435\u0436\u0440\u0430\u0439\u043e\u043d\u043d\u0430\u044f \u0438\u043d\u0441\u043f\u0435\u043a\u0446\u0438\u044f \u0424\u0435\u0434\u0435\u0440\u0430\u043b\u044c\u043d\u043e\u0439 \u043d\u0430\u043b\u043e\u0433\u043e\u0432\u043e\u0439 \u0441\u043b\u0443\u0436\u0431\u044b \u211611 \u043f\u043e \u0425\u0430\u043d\u0442\u044b-\u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u043e\u043c\u0443 \u0430\u0432\u0442\u043e\u043d\u043e\u043c\u043d\u043e\u043c\u0443 \u043e\u043a\u0440\u0443\u0433\u0443 - \u042e\u0433\u0440\u0435", "\u0410\u0434\u0440\u0435\u0441\u041e\u0440\u0433": "628408, \u0425\u0430\u043d\u0442\u044b-\u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u0438\u0439 - \u042e\u0433\u0440\u0430 \u0410\u041e, \u0421\u0443\u0440\u0433\u0443\u0442 \u0433, \u0420\u0435\u0441\u043f\u0443\u0431\u043b\u0438\u043a\u0438 \u0443\u043b, \u0434 73, \u043a\u043e\u0440\u043f 1"}, "\u0420\u0435\u0433\u041f\u0424\u0420": {"\u0414\u0430\u0442\u0430\u0420\u0435\u0433": "2011-09-22", "\u0420\u0435\u0433\u041d\u043e\u043c\u0435\u0440": "027020066878", "\u041a\u043e\u0434\u041e\u0440\u0433": "027020", "\u041d\u0430\u0438\u043c\u041e\u0440\u0433": "\u0413\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0435 \u0443\u0447\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u0435 - \u041e\u0442\u0434\u0435\u043b\u0435\u043d\u0438\u0435 \u041f\u0435\u043d\u0441\u0438\u043e\u043d\u043d\u043e\u0433\u043e \u0444\u043e\u043d\u0434\u0430 \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438 \u043f\u043e \u0425\u0430\u043d\u0442\u044b - \u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u043e\u043c\u0443 \u0430\u0432\u0442\u043e\u043d\u043e\u043c\u043d\u043e\u043c\u0443 \u043e\u043a\u0440\u0443\u0433\u0443 - \u042e\u0433\u0440\u0435"}, "\u0420\u0435\u0433\u0424\u0421\u0421": {"\u0414\u0430\u0442\u0430\u0420\u0435\u0433": "2011-09-23", "\u0420\u0435\u0433\u041d\u043e\u043c\u0435\u0440": "860201999886021", "\u041a\u043e\u0434\u041e\u0440\u0433": "8602", "\u041d\u0430\u0438\u043c\u041e\u0440\u0433": "\u0424\u0438\u043b\u0438\u0430\u043b \u21162 \u0413\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0433\u043e \u0443\u0447\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u044f - \u0440\u0435\u0433\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043e\u0442\u0434\u0435\u043b\u0435\u043d\u0438\u044f \u0424\u043e\u043d\u0434\u0430 \u0441\u043e\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0441\u0442\u0440\u0430\u0445\u043e\u0432\u0430\u043d\u0438\u044f \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438 \u043f\u043e \u0425\u0430\u043d\u0442\u044b-\u041c\u0430\u043d\u0441\u0438\u0439\u0441\u043a\u043e\u043c\u0443 \u0430\u0432\u0442\u043e\u043d\u043e\u043c\u043d\u043e\u043c\u0443 \u043e\u043a\u0440\u0443\u0433\u0443 - \u042e\u0433\u0440\u0435"}, "\u0423\u0441\u0442\u041a\u0430\u043f": {"\u0422\u0438\u043f": "\u0423\u0421\u0422\u0410\u0412\u041d\u042b\u0419 \u041a\u0410\u041f\u0418\u0422\u0410\u041b", "\u0421\u0443\u043c\u043c\u0430": 10000}, "\u0423\u043f\u0440\u041e\u0440\u0433": {}, "\u0420\u0443\u043a\u043e\u0432\u043e\u0434": [{"\u0424\u0418\u041e": "\u041a\u0443\u0445\u0430\u0440\u0447\u0443\u043a \u0413\u0443\u043b\u044c\u043d\u0430\u0440\u0430 \u0420\u0438\u043d\u0430\u0442\u043e\u0432\u043d\u0430", "\u0418\u041d\u041d": "860204210091", "\u0412\u0438\u0434\u0414\u043e\u043b\u0436\u043d": "\u0420\u0423\u041a\u041e\u0412\u041e\u0414\u0418\u0422\u0415\u041b\u042c \u042e\u0420\u0418\u0414\u0418\u0427\u0415\u0421\u041a\u041e\u0413\u041e \u041b\u0418\u0426\u0410", "\u041d\u0430\u0438\u043c\u0414\u043e\u043b\u0436\u043d": "\u0414\u0418\u0420\u0415\u041a\u0422\u041e\u0420", "\u041d\u0435\u0434\u043e\u0441\u0442": false, "\u041c\u0430\u0441\u0441\u0420\u0443\u043a\u043e\u0432\u043e\u0434": false, "\u0414\u0438\u0441\u043a\u0432\u041b\u0438\u0446\u043e": false, "\u0421\u0432\u044f\u0437\u0420\u0443\u043a\u043e\u0432\u043e\u0434": ["1178617014311"], "\u0421\u0432\u044f\u0437\u0423\u0447\u0440\u0435\u0434": ["1178617014311"]}], "\u0423\u0447\u0440\u0435\u0434": {"\u0424\u041b": [{"\u0424\u0418\u041e": "\u041a\u0443\u0445\u0430\u0440\u0447\u0443\u043a \u0413\u0443\u043b\u044c\u043d\u0430\u0440\u0430 \u0420\u0438\u043d\u0430\u0442\u043e\u0432\u043d\u0430", "\u0418\u041d\u041d": "860204210091", "\u041d\u0435\u0434\u043e\u0441\u0442": false, "\u0414\u043e\u043b\u044f": {"\u041d\u043e\u043c\u0438\u043d\u0430\u043b": 10000.0, "\u041f\u0440\u043e\u0446\u0435\u043d\u0442": 100.0}, "\u0421\u0432\u044f\u0437\u0420\u0443\u043a\u043e\u0432\u043e\u0434": ["1178617014311"], "\u0421\u0432\u044f\u0437\u0423\u0447\u0440\u0435\u0434": ["1178617014311"]}], "\u0420\u043e\u0441\u041e\u0440\u0433": [], "\u0418\u043d\u041e\u0440\u0433": [], "\u041f\u0418\u0424": [], "\u0420\u0424": []}, "\u0421\u0432\u044f\u0437\u0423\u043f\u0440\u041e\u0440\u0433": [], "\u0421\u0432\u044f\u0437\u0423\u0447\u0440\u0435\u0434": [], "\u0414\u0435\u0440\u0436\u0420\u0435\u0435\u0441\u0442\u0440\u0410\u041e": {}, "\u041b\u0438\u0446\u0435\u043d\u0437": [{"\u041d\u043e\u043c\u0435\u0440": "\u041b041-01193-86/00380582", "\u0414\u0430\u0442\u0430": "2012-04-16", "\u041b\u0438\u0446\u041e\u0440\u0433": "\u0424\u0415\u0414\u0415\u0420\u0410\u041b\u042c\u041d\u0410\u042f \u0421\u041b\u0423\u0416\u0411\u0410 \u041f\u041e \u041d\u0410\u0414\u0417\u041e\u0420\u0423 \u0412 \u0421\u0424\u0415\u0420\u0415 \u0417\u0414\u0420\u0410\u0412\u041e\u041e\u0425\u0420\u0410\u041d\u0415\u041d\u0418\u042f", "\u0412\u0438\u0434\u0414\u0435\u044f\u0442": ["\u041c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u0430\u044f \u0434\u0435\u044f\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u044c (\u0437\u0430 \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435\u043c \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0439 \u0434\u0435\u044f\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u0438, \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u043c\u043e\u0439 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u0438\u043c\u0438 \u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f\u043c\u0438 \u0438 \u0434\u0440\u0443\u0433\u0438\u043c\u0438 \u043e\u0440\u0433\u0430\u043d\u0438\u0437\u0430\u0446\u0438\u044f\u043c\u0438, \u0432\u0445\u043e\u0434\u044f\u0449\u0438\u043c\u0438 \u0432 \u0447\u0430\u0441\u0442\u043d\u0443\u044e \u0441\u0438\u0441\u0442\u0435\u043c\u0443 \u0437\u0434\u0440\u0430\u0432\u043e\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u0438\u044f, \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u0438\u043d\u043d\u043e\u0432\u0430\u0446\u0438\u043e\u043d\u043d\u043e\u0433\u043e \u0446\u0435\u043d\u0442\u0440\u0430 \"\u0421\u043a\u043e\u043b\u043a\u043e\u0432\u043e\")"]}], "\u041f\u043e\u0434\u0440\u0430\u0437\u0434": {}, "\u041f\u0440\u0430\u0432\u043e\u043f\u0440\u0435\u0434\u0448": [], "\u041f\u0440\u0430\u0432\u043e\u043f\u0440\u0435\u0435\u043c": [], "\u0414\u0430\u0442\u0430\u0412\u044b\u043f": "2022-09-17", "\u041a\u043e\u043d\u0442\u0430\u043a\u0442\u044b": {"\u0422\u0435\u043b": ["+73462951144", "+73462352044", "+73462534202", "+79222500055"], "\u0415\u043c\u044d\u0439\u043b": [], "\u0412\u0435\u0431\u0421\u0430\u0439\u0442": "http://www.orchid-dental.ru"}, "\u041d\u0430\u043b\u043e\u0433\u0438": {"\u041e\u0441\u043e\u0431\u0420\u0435\u0436\u0438\u043c": [], "\u0421\u0432\u0435\u0434\u0423\u043f\u043b": [{"\u041d\u0430\u0438\u043c": "\u0421\u0442\u0440\u0430\u0445\u043e\u0432\u044b\u0435 \u0432\u0437\u043d\u043e\u0441\u044b \u043d\u0430 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435 \u0441\u043e\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0441\u0442\u0440\u0430\u0445\u043e\u0432\u0430\u043d\u0438\u0435 \u043d\u0430 \u0441\u043b\u0443\u0447\u0430\u0439 \u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \u043d\u0435\u0442\u0440\u0443\u0434\u043e\u0441\u043f\u043e\u0441\u043e\u0431\u043d\u043e\u0441\u0442\u0438 \u0438 \u0432 \u0441\u0432\u044f\u0437\u0438 \u0441 \u043c\u0430\u0442\u0435\u0440\u0438\u043d\u0441\u0442\u0432\u043e\u043c", "\u0421\u0443\u043c\u043c\u0430": 0.0}, {"\u041d\u0430\u0438\u043c": "\u0421\u0442\u0440\u0430\u0445\u043e\u0432\u044b\u0435 \u0432\u0437\u043d\u043e\u0441\u044b \u043d\u0430 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u043e\u0435 \u0441\u0442\u0440\u0430\u0445\u043e\u0432\u0430\u043d\u0438\u0435 \u0440\u0430\u0431\u043e\u0442\u0430\u044e\u0449\u0435\u0433\u043e \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f, \u0437\u0430\u0447\u0438\u0441\u043b\u044f\u0435\u043c\u044b\u0435 \u0432 \u0431\u044e\u0434\u0436\u0435\u0442 \u0424\u0435\u0434\u0435\u0440\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0444\u043e\u043d\u0434\u0430 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u043e\u0433\u043e \u0441\u0442\u0440\u0430\u0445\u043e\u0432\u0430\u043d\u0438\u044f", "\u0421\u0443\u043c\u043c\u0430": 249100.0}, {"\u041d\u0430\u0438\u043c": "\u041d\u0430\u043b\u043e\u0433, \u0432\u0437\u0438\u043c\u0430\u0435\u043c\u044b\u0439 \u0432 \u0441\u0432\u044f\u0437\u0438 \u0441  \u043f\u0440\u0438\u043c\u0435\u043d\u0435\u043d\u0438\u0435\u043c \u0443\u043f\u0440\u043e\u0449\u0435\u043d\u043d\u043e\u0439  \u0441\u0438\u0441\u0442\u0435\u043c\u044b \u043d\u0430\u043b\u043e\u0433\u043e\u043e\u0431\u043b\u043e\u0436\u0435\u043d\u0438\u044f", "\u0421\u0443\u043c\u043c\u0430": 795000.0}, {"\u041d\u0430\u0438\u043c": "\u0421\u0442\u0440\u0430\u0445\u043e\u0432\u044b\u0435 \u0438 \u0434\u0440\u0443\u0433\u0438\u0435 \u0432\u0437\u043d\u043e\u0441\u044b \u043d\u0430 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435 \u043f\u0435\u043d\u0441\u0438\u043e\u043d\u043d\u043e\u0435 \u0441\u0442\u0440\u0430\u0445\u043e\u0432\u0430\u043d\u0438\u0435, \u0437\u0430\u0447\u0438\u0441\u043b\u044f\u0435\u043c\u044b\u0435 \u0432 \u041f\u0435\u043d\u0441\u0438\u043e\u043d\u043d\u044b\u0439 \u0444\u043e\u043d\u0434 \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438", "\u0421\u0443\u043c\u043c\u0430": 889000.0}, {"\u041d\u0430\u0438\u043c": "\u041d\u0415\u041d\u0410\u041b\u041e\u0413\u041e\u0412\u042b\u0415 \u0414\u041e\u0425\u041e\u0414\u042b, \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0435\u043c\u044b\u0435 \u043d\u0430\u043b\u043e\u0433\u043e\u0432\u044b\u043c\u0438 \u043e\u0440\u0433\u0430\u043d\u0430\u043c\u0438", "\u0421\u0443\u043c\u043c\u0430": 0.0}], "\u0421\u0443\u043c\u0423\u043f\u043b": "1933100.00", "\u0421\u0443\u043c\u041d\u0435\u0434\u043e\u0438\u043c": null}, "\u0420\u041c\u0421\u041f": {"\u041a\u0430\u0442": "\u041c\u0410\u041b\u041e\u0415 \u041f\u0420\u0415\u0414\u041f\u0420\u0418\u042f\u0422\u0418\u0415", "\u0414\u0430\u0442\u0430\u0412\u043a\u043b": "2016-08-01"}, "\u0421\u0427\u0420": 16, "\u041d\u0435\u0434\u043e\u0431\u041f\u043e\u0441\u0442": false, "\u0414\u0438\u0441\u043a\u0432\u041b\u0438\u0446\u0430": false, "\u041c\u0430\u0441\u0441\u0420\u0443\u043a\u043e\u0432\u043e\u0434": false, "\u041c\u0430\u0441\u0441\u0423\u0447\u0440\u0435\u0434": false}, "meta": {"status": "ok", "today_request_count": 3}}
# a = {'data': {'ДатаВып': '2022-02-18',
#           'ДатаОГРН': '2016-02-29',
#           'ДатаРег': '2016-02-29',
#           'ДержРеестрАО': {},
#           'ДисквЛица': False,
#           'ИНН': '5047181263',
#           'КПП': '774301001',
#           'Контакты': {'ВебСайт': None, 'Емэйл': [], 'Тел': ['+74955000178']},
#           'Лиценз': [],
#           'МассРуковод': False,
#           'МассУчред': False,
#           'НаимПолн': 'ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "БИОН"',
#           'НаимСокр': 'ООО БИОН',
#           'Налоги': {},
#           'НедобПост': False,
#           'ОГРН': '1165047052202',
#           'ОКАТО': {'Код': '45277577000', 'Наим': 'Западное Дегунино'},
#           'ОКВЭД': {'Версия': '2014',
#                     'Код': '46.51',
#                     'Наим': 'Торговля оптовая компьютерами, периферийными '
#                             'устройствами к компьютерам и программным '
#                             'обеспечением'},
#           'ОКВЭДДоп': [{'Версия': '2014',
#                         'Код': '33.20',
#                         'Наим': 'Монтаж промышленных машин и оборудования'},
#                        {'Версия': '2014',
#                         'Код': '46.14.1',
#                         'Наим': 'Деятельность агентов по оптовой торговле '
#                                 'вычислительной техникой, телекоммуникационным '
#                                 'оборудованием и прочим офисным оборудованием'},
#                        {'Версия': '2014',
#                         'Код': '46.43',
#                         'Наим': 'Торговля оптовая бытовыми электротоварами'},
#                        {'Версия': '2014',
#                         'Код': '46.49.3',
#                         'Наим': 'Торговля оптовая книгами, газетами и '
#                                 'журналами, писчебумажными и канцелярскими '
#                                 'товарами'},
#                        {'Версия': '2014',
#                         'Код': '46.66',
#                         'Наим': 'Торговля оптовая прочей офисной техникой и '
#                                 'оборудованием'},
#                        {'Версия': '2014',
#                         'Код': '47.43',
#                         'Наим': 'Торговля розничная аудио- и видеотехникой в '
#                                 'специализированных магазинах'},
#                        {'Версия': '2014',
#                         'Код': '47.54',
#                         'Наим': 'Торговля розничная бытовыми электротоварами в '
#                                 'специализированных магазинах'},
#                        {'Версия': '2014',
#                         'Код': '47.91.2',
#                         'Наим': 'Торговля розничная, осуществляемая '
#                                 'непосредственно при помощи '
#                                 'информационно-коммуникационной сети Интернет'},
#                        {'Версия': '2014',
#                         'Код': '47.91.3',
#                         'Наим': 'Торговля розничная через Интернет-аукционы'},
#                        {'Версия': '2014',
#                         'Код': '47.91.4',
#                         'Наим': 'Торговля розничная, осуществляемая '
#                                 'непосредственно при помощи телевидения, '
#                                 'радио, телефона'},
#                        {'Версия': '2014',
#                         'Код': '52.10',
#                         'Наим': 'Деятельность по складированию и хранению'},
#                        {'Версия': '2014',
#                         'Код': '52.29',
#                         'Наим': 'Деятельность вспомогательная прочая, '
#                                 'связанная с перевозками'},
#                        {'Версия': '2014',
#                         'Код': '62.01',
#                         'Наим': 'Разработка компьютерного программного '
#                                 'обеспечения'},
#                        {'Версия': '2014',
#                         'Код': '62.02',
#                         'Наим': 'Деятельность консультативная и работы в '
#                                 'области компьютерных технологий'},
#                        {'Версия': '2014',
#                         'Код': '62.09',
#                         'Наим': 'Деятельность, связанная с использованием '
#                                 'вычислительной техники и информационных '
#                                 'технологий, прочая'},
#                        {'Версия': '2014',
#                         'Код': '63.11',
#                         'Наим': 'Деятельность по обработке данных, '
#                                 'предоставление услуг по размещению информации '
#                                 'и связанная с этим деятельность'},
#                        {'Версия': '2014',
#                         'Код': '63.11.1',
#                         'Наим': 'Деятельность по созданию и использованию баз '
#                                 'данных и информационных ресурсов'},
#                        {'Версия': '2014',
#                         'Код': '68.20',
#                         'Наим': 'Аренда и управление собственным или '
#                                 'арендованным недвижимым имуществом'},
#                        {'Версия': '2014',
#                         'Код': '68.32',
#                         'Наим': 'Управление недвижимым имуществом за '
#                                 'вознаграждение или на договорной основе'},
#                        {'Версия': '2014',
#                         'Код': '70.22',
#                         'Наим': 'Консультирование по вопросам коммерческой '
#                                 'деятельности и управления'},
#                        {'Версия': '2014',
#                         'Код': '73.20',
#                         'Наим': 'Исследование конъюнктуры рынка и изучение '
#                                 'общественного мнения'},
#                        {'Версия': '2014',
#                         'Код': '77.39.1',
#                         'Наим': 'Аренда и лизинг прочих сухопутных '
#                                 'транспортных средств и оборудования'},
#                        {'Версия': '2014',
#                         'Код': '95.11',
#                         'Наим': 'Ремонт компьютеров и периферийного '
#                                 'компьютерного оборудования'},
#                        {'Версия': '2014',
#                         'Код': '95.22.1',
#                         'Наим': 'Ремонт бытовой техники'}],
#           'ОКОГУ': {'Код': '4210011',
#                     'Наим': 'Хозяйственные общества и товарищества с участием '
#                             'иностранных юридических и (или) физических лиц, а '
#                             'также лиц без гражданства'},
#           'ОКОПФ': {'Код': '12300',
#                     'Наим': 'Общества с ограниченной ответственностью'},
#           'ОКПО': '00605915',
#           'ОКТМО': {'Код': '45340000000',
#                     'Наим': 'муниципальный округ Западное Дегунино'},
#           'ОКФС': {'Код': '34',
#                    'Наим': 'Совместная частная и иностранная собственность'},
#           'Подразд': {},
#           'Правопредш': [],
#           'Правопреем': [],
#           'РМСП': {},
#           'РегПФР': {'ДатаРег': '2019-07-12',
#                      'КодОрг': '087208',
#                      'НаимОрг': 'Государственное учреждение - Главное '
#                                 'Управление Пенсионного фонда РФ №5 по г. '
#                                 'Москве и Московской области муниципальный '
#                                 'район Западное Дегунино г. Москвы',
#                      'РегНомер': '087208015129'},
#           'РегФНС': {'АдресОрг': '125373, г. Москва, Походный проезд, '
#                                  'домовладение 3, стр. 2',
#                      'КодОрг': '7746',
#                      'НаимОрг': 'Межрайонная инспекция Федеральной налоговой '
#                                 'службы №46 по г. Москве'},
#           'РегФСС': {'ДатаРег': '2019-07-10',
#                      'КодОрг': '7720',
#                      'НаимОрг': 'Филиал №20 Государственного учреждения - '
#                                 'Московского регионального отделения Фонда '
#                                 'социального страхования Российской Федерации',
#                      'РегНомер': '504301643077201'},
#           'Регион': {'Код': '77', 'Наим': 'Москва'},
#           'Руковод': [{'ВидДолжн': 'РУКОВОДИТЕЛЬ ЮРИДИЧЕСКОГО ЛИЦА',
#                        'ДисквЛицо': False,
#                        'ИНН': '771907893249',
#                        'МассРуковод': False,
#                        'НаимДолжн': 'ДИРЕКТОР',
#                        'Недост': False,
#                        'СвязРуковод': ['1067761785442'],
#                        'СвязУчред': [],
#                        'ФИО': 'Бударина Ирина Александровна'}],
#           'СЧР': None,
#           'СвязУпрОрг': [],
#           'СвязУчред': [],
#           'Статус': {'Код': '001', 'Наим': 'Действует'},
#           'УпрОрг': {},
#           'УстКап': {'Сумма': 200000, 'Тип': 'УСТАВНЫЙ КАПИТАЛ'},
#           'Учред': {'ИнОрг': [],
#                     'ПИФ': [],
#                     'РФ': [],
#                     'РосОрг': [],
#                     'ФЛ': [{'Доля': {'Номинал': 10000.0, 'Процент': 5.0},
#                             'ИНН': '773718040200',
#                             'Недост': False,
#                             'СвязРуковод': [],
#                             'СвязУчред': [],
#                             'ФИО': 'Ишкова Марина Ивановна'},
#                            {'Доля': {'Номинал': 48000.0, 'Процент': 24.0},
#                             'ИНН': '771700459518',
#                             'Недост': False,
#                             'СвязРуковод': ['1027739099783', '1035005525741'],
#                             'СвязУчред': ['1037722024526',
#                                           '1027739099783',
#                                           '1027739082843',
#                                           '1027739021155'],
#                             'ФИО': 'Ковалев Алексей Юрьевич'},
#                            {'Доля': {'Номинал': 48000.0, 'Процент': 24.0},
#                             'ИНН': '771600669776',
#                             'Недост': False,
#                             'СвязРуковод': [],
#                             'СвязУчред': ['1037722024526',
#                                           '1027739099783',
#                                           '1027739082843',
#                                           '1027739021155'],
#                             'ФИО': 'Смирнов Виктор Евгеньевич'},
#                            {'Доля': {'Номинал': 47000.0, 'Процент': 23.5},
#                             'ИНН': '771608958152',
#                             'Недост': False,
#                             'СвязРуковод': [],
#                             'СвязУчред': [],
#                             'ФИО': 'Ковалева Людмила Ивановна'},
#                            {'Доля': {'Номинал': 47000.0, 'Процент': 23.5},
#                             'ИНН': '771607061120',
#                             'Недост': False,
#                             'СвязРуковод': [],
#                             'СвязУчред': [],
#                             'ФИО': 'Смирнова Галина Владимировна'}]},
#           'ЮрАдрес': {'АдресРФ': '125599, г. Москва, ул. Бусиновская Горка, д. '
#                                  '2, стр. 2, этаж 6 пом. XIII комната 1',
#                       'ИдГАР': None,
#                       'НасПункт': 'г. Москва',
#                       'Недост': False}},
#  'meta': {'status': 'ok', 'today_request_count': 3}}

with open('data.json', 'r') as f:
    a = json.load(f)

class Ul:
    def __init__(self, inn, ogrn, full_name, abbreviated_name,
                 date_reg, status, legal_adress, okved, reg_fns,
                 reg_pfr, reg_fss, authorized_capital, management_company,
                 manager, founders, register_of_shareholders, license,
                 divisions, legal_successor, legal_successor_2, contacts,
                 nalogs, rmsp, average_number, unscrupulous_supplier,
                 disqualified_persons, mass_manager, mass_founder, meta_info
                                                                              ):
        self.inn = inn
        self.ogrn = ogrn
        self.full_name = full_name
        self.abbreviated_name = abbreviated_name
        self.date_reg = date_reg
        self.status = status
        self.legal_adress = legal_adress
        self.okved = okved
        self.reg_fns = reg_fns
        self.reg_pfr = reg_pfr
        self.reg_fss = reg_fss
        self.authorized_capital = authorized_capital
        self.management_company = management_company
        self.manager = manager
        self.founders = founders
        self.register_of_shareholders = register_of_shareholders
        self.license = license
        self.divisions = divisions
        self.legal_successor = legal_successor
        self.legal_successor_2 = legal_successor_2
        self.contacts = contacts
        self.nalogs = nalogs
        self.rmsp = rmsp
        self.average_number = average_number
        self.unscrupulous_supplier = unscrupulous_supplier
        self.disqualified_persons = disqualified_persons
        self.mass_manager = mass_manager
        self.mass_founder = mass_founder
        self.meta_info = meta_info



    def founder(self):
        founders_list = []
        for founder in self.founders:
            if len(self.founders[founder]) > 0:
                print(self.founder)

    def manager_data(self):
        print(self.manager)
        for manager_data in self.manager:
            print(manager_data['НаимДолжн'].capitalize())
            print(manager_data['ФИО'])
            print(manager_data['ИНН'])
            print(manager_data['Недост'])
            print(manager_data['СвязРуковод'])
            print(manager_data['СвязУчред'])
            print(manager_data['ДисквЛицо'])
            print(manager_data['МассРуковод'])


org = Ul(
         a['data']['ИНН'],
         a['data']['ОГРН'],
         a['data']['НаимПолн'],
         a['data']['НаимСокр'],
         a['data']['ДатаРег'],
         a['data']['Статус'],
         a['data']['ЮрАдрес'],
         a['data']['ОКВЭД'],
         a['data']['РегФНС'],
         a['data']['РегПФР'],
         a['data']['РегФСС'],
         a['data']['УстКап'],
         a['data']['УпрОрг'],
         a['data']['Руковод'],
         a['data']['Учред'],
         a['data']['ДержРеестрАО'],
         a['data']['Лиценз'],
         a['data']['Подразд'],
         a['data']['Правопредш'],
         a['data']['Правопреем'],
         a['data']['Контакты'],
         a['data']['Налоги'],
         a['data']['РМСП'],
         a['data']['СЧР'],
         a['data']['НедобПост'],
         a['data']['ДисквЛица'],
         a['data']['МассРуковод'],
         a['data']['МассУчред'],
         a['meta']
                                    )

# print(f'{org.full_name}\n ИНН: {org.inn}\n ОГРН: {org.ogrn}')


# my_dict = {'full_name': org.full_name,
#            'abbreviated_name': org.abbreviated_name,
#            'inn': org.inn,
#            'ogrn': org.ogrn,
#            'authorized_capital': f"{org.authorized_capital['Тип'].capitalize()}"
#                                  f" - {org.authorized_capital['Сумма']} рублей"
#            }

# pprint(my_dict)
# print(f"{org.authorized_capital['Тип'].capitalize()} - {org.authorized_capital['Сумма']} рублей")



print(org.manager[0])